       01 ACC-CTRL-BLK.
               05 ACC-CTRL-RET-CODE COMP-5 PIC 9(5).
               05 ACC-CTRL-EXTFH-CODE      PIC 9(5).
               05 ACC-CTRL-ERR-MSG         PIC X(60).
               05 ACC-COUNT       COMP-5   PIC 9(3).