       01 :PREFIX:ACC-REC.
               05 :PREFIX:ACC-ID    PIC 9(3).
               05 :PREFIX:ACC-NAME.
                     10 :PREFIX:ACC-LNAME PIC X(30).
                     10 :PREFIX:ACC-FNAME PIC X(30).
               05 :PREFIX:ACC-BALANCE     PIC S9999V.99.