       01 SCREEN-VARS.
           05 SCREEN-BUFF PIC X(5).
           05 SCREEN-KEY PIC X(1).
           05 SCREEN-MSG PIC X(78).
           05 SCREEN-MSG-2 PIC X(78).
           05 SCREEN-LEN PIC 9(5) COMP-5.
           05 SCREEN-ANSWER PIC X.
             88 SCREEN-YES VALUE 'Y'.             
             88 SCREEN-NO  VALUE 'N'.