       01 :PREFIX:TRAN-LINE-REC.
               05 :PREFIX:TL-ID.
                 10 :PREFIX:TL-TRAN-ID    PIC 9(5). 
                 10 :PREFIX:TL-ACC        PIC 9(3).
               05 :PREFIX:TL-AMOUNT       PIC -9999V99.
