       01 :PREFIX:TRAN-REC.
               05 :PREFIX:TRAN-ID    PIC 9(5).
               05 :PREFIX:TRAN-DATE  PIC 9(8).
               05 :PREFIX:TRAN-STATUS PIC X(1).
                 88 :PREFIX:TRAN-OPEN  VALUE "O".
                 88 :PREFIX:TRAN-CLOSE VALUE "C".
               05 :PREFIX:TRAN-BALANCE PIC -99999V99.
               05 :PREFIX:TRAN-LINE-COUNT PIC 9(3) COMP-5.
               05 :PREFIX:TRAN-DESC PIC X(40).