       01 TRAN-CTRL-BLK.
               05 TRAN-CTRL-RET-CODE COMP-5 PIC 9(5).
               05 TRAN-CTRL-EXTFH-CODE      PIC 9(5).
               05 TRAN-CTRL-ERR-MSG         PIC X(60).
               05 TRAN-OPENED-COUNT       COMP-5   PIC 9(5).               
               05 TRAN-CLOSED-COUNT       COMP-5   PIC 9(5).

